:PROPERTIES:
:ID:       9061b34f-e56f-4ab1-9019-c4bbe1c41474
:END:
#+title: java-thrd-LockSupport
#+date: [2024-08-07 三]
#+last_modified:  


#+HEADER: :noweb yes
#+BEGIN_SRC java
  <<jdemo>>

  <<jDemo>>
       <<j_-$obj>>
       public void doChange(int idx)<<jie>>{
	      synchronized(obj){
		 JUtil.log(idx);
		 LockSupport.park();
	      }
       }

  <<jdoDemo>>
    final var demo = <<jnewDemo>>

    var workRun =
    <<jrun>>
	  try{
	    demo.doChange(<<jrand0..99>>);
	  }<<jcatch>>
    <<jendrun>>

    Thread t1 = new Thread(workRun);
    Thread t2 = new Thread(workRun);

     t1.start();
     <<jsleep1ms>>
     t2.start();

     LockSupport.unpark(t1);
     LockSupport.unpark(t2);
     t1.join();
     t2.join();
    <<jend>>
  <<jend>>
#+END_SRC

#+RESULTS:
: 48
: 5
